---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireSize
source: html/e4a5cfed-7952-4622-5fca-b556703e36b6.htm
---
# Autodesk.Revit.DB.Electrical.WireSize

Represents specific electrical wire size information.

## Syntax (C#)
```csharp
public class WireSize : APIObject
```

## Remarks
Wire size is defined based on corresponding wire material type and temperature rating type.